PATRONYMIC_RULES = {
    ('н', 'с', 'т', 'р', 'л', 'д', 'п', 'м', 'к', 'г', 'в', 'з'): (False, 'ович', 'овна'),
    ('а', ): (True, 'ич', 'ична'),
    ('й', 'ь'): (True, 'евич', 'евна'),
}

TRANSLITERATE_TABLE = {
    'А': 'A', 'Б': 'B', 'В': 'V', 'Г': 'G', 'Д': 'D', 'Е': 'E', 'Ё': 'E',
    'Ж': 'Zh', 'З': 'Z', 'И': 'I', 'Й': 'Y', 'К': 'K', 'Л': 'L', 'М': 'M',
    'Н': 'N', 'О': 'O', 'П': 'P', 'Р': 'R', 'С': 'S', 'Т': 'T', 'У': 'U',
    'Ф': 'F', 'Х': 'H', 'Ц': 'Ts', 'Ч': 'Ch', 'Ш': 'Sh', 'Щ': 'Sch', 'Ъ': '',
    'Ы': 'Y', 'Ь': '', 'Э': 'E', 'Ю': 'Y', 'Я': 'Ya',
    'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e',
    'ж': 'zh', 'з': 'z', 'и': 'i', 'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm',
    'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't', 'у': 'u',
    'ф': 'f', 'х': 'h', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'sch', 'ъ': '',
    'ы': 'y', 'ь': '', 'э': 'e', 'ю': 'y', 'я': 'ya',
}

SUFFIXES_MAN = {
    'ов',
    'ев',
    'ёв',
    'ин',
    'ын',
    'их',
    'ых',
    # 'ской',
    'ский',
    # 'цкой',
    'цкий',
}

SUFFIXES_WOMAN = {
    'ова',
    'ева',
    'ёва',
    'ина',
    'ына',
    'их',
    'ых',
    'ская',
    'цкая',
}

SUFFIXES = SUFFIXES_MAN.union(SUFFIXES_WOMAN)
